Revit 2026 API

# TextEditorOptions Properties

---

The TextEditorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowBorder | Show the border box around the text during editing. |
|  | ShowOpaqueBackground | Show opaque background behind the text during editing. |

#### Reference

TextEditorOptions Class

Autodesk.Revit.UI Namespace